In [4]:
import pandas as pd

In [5]:
# Load the dataset
dataset = pd.read_csv('DataSet.csv')

In [14]:
dataset.describe()

,query,optimized query
count,315,315
unique,265,277
top,CREATE TABLE employees ( employee_id INT PRIMA...,CREATE INDEX idx_sales_profit ON sales(profit);
freq,3,4

In [17]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 315 entries, 0 to 314
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   query            315 non-null    object
 1   optimized query  315 non-null    object
dtypes: object(2)
memory usage: 5.1+ KB

In [7]:
# Remove duplicates based on both 'query' and 'optimized query' columns
cleaned_dataset = dataset.drop_duplicates(subset=['query', 'optimized query'])

In [8]:
# Save the cleaned dataset to a new CSV file
cleaned_dataset.to_csv('cleaned_dataset.csv', index=False)

In [12]:
cleaned_dataset.describe()

,query,optimized query
count,296,296
unique,265,277
top,SELECT * FROM Department WHERE department_name...,CREATE INDEX idx_products_price ON products(pr...
freq,2,3

In [18]:
cleaned_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 296 entries, 0 to 314
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   query            296 non-null    object
 1   optimized query  296 non-null    object
dtypes: object(2)
memory usage: 6.9+ KB

In [19]:
cleaned_dataset.head()

,query,optimized query
0,SELECT * FROM Professor WHERE first_name = 'Jo...,"SELECT professor_id, last_name FROM Professor ..."
1,SELECT * FROM Course WHERE course_code = 'MATH...,"SELECT course_id, course_name, credit_hours FR..."
2,SELECT * FROM Enrollment WHERE student_id IN (...,SELECT course_id FROM Enrollment WHERE student...
3,SELECT * FROM Classroom WHERE building_name = ...,"SELECT classroom_id, room_number, capacity FRO..."
4,SELECT * FROM Exam WHERE course_id = 1 AND exa...,"SELECT exam_id, exam_date, exam_duration FROM ..."